org/noninformative_priors.org
#+SETUPFILE:./hugo_setup.org
#+HUGO_SLUG: noninformative_priors
#+TITLE: Non-informative Priors

Non-informative priors are used in [[file:bayesian_inference.org][Bayesian Inference]], in the
situation where no prior information exists, or inference based
dominantly on the data is desired. We wish to find a distribution
$p(\theta)$ that contained "no information" about $\theta$ (favours no
value of $\theta$ over another).

An example of such a non-informative prior in the discrete space would
be a uniform distribution over $\theta$.
