content/posts/noninformative_priors.md
+++
title = "Non-informative Priors"
author = ["Jethro Kuan"]
lastmod = 2020-06-07T17:26:35+08:00
slug = "noninformative_priors"
draft = false
+++

## Backlinks {#backlinks}

- [Reference Prior]({{< relref "reference_prior" >}})

Non-informative priors are used in [Bayesian Inference]({{< relref "bayesian_inference" >}}), in the
situation where no prior information exists, or inference based
dominantly on the data is desired. We wish to find a distribution
\\(p(\theta)\\) that contained "no information" about \\(\theta\\) (favours no
value of \\(\theta\\) over another).

An example of such a non-informative prior in the discrete space would
be a uniform distribution over \\(\theta\\).
